app/controllers/freelancers_controller.rb

SELECT "profiles".* FROM "profiles"
SELECT freelancers.skills, freelancers.sallary, freelancers.eng_level, freelancers.rating, freelancers.category, profiles.name, profiles.surname, profiles.location, profiles.aboutme FROM "freelancers" INNER JOIN "profiles" ON "profiles"."id" = "freelancers"."profile_id"
---
  def search
    @freelancers = Freelancer.all( :joins => :profile, :select => "freelancers.skills, freelancers.sallary, freelancers.rating, freelancers.category, profiles.name, profiles.surname, profiles.location, profiles.aboutme")