app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
  	def show
   		@users = User.find(1)

INSERT INTO "users" ("created_at", "email", "login", "password", "role", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Tue, 02 Oct 2012 11:05:33 UTC +00:00], ["email", "mail@mail.com"], ["login", "jetfire"], ["password", "100500"], ["role", "on"], ["updated_at", Tue, 02 Oct 2012 11:05:33 UTC +00:00]]
INSERT INTO "profiles" ("aboutme", "birth", "city", "created_at", "location", "name", "photo", "sex", "surname", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  	def create
    	@user = User.new(params[:user])
    	respond_to do |format|
    	if @user.save
        	format.json { render :json => { :success => true, :users => [@user] } }
    	end

    	@user.create_profile()